[
    {
        "id": 1,
        "type": "Combat",
        "title": "Horrible Knight for a Fight",
        "text": "A knight with a vendetta draws their weapon!",
        "imageUrl": "https://i.pinimg.com/originals/ec/76/a6/ec76a6bc705d3b8620431b791ddbb761.jpg"
    },
    {
        "id": 2,
        "type": "Combat",
        "title": "Hitchcock was right",
        "text": "You are attacked by a wild kite!",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Milvus_migrans_2005-new.jpg"
    },
    {
        "id": 3,
        "type": "Combat",
        "title": "Griffin",
        "text": "You encounter a griffin!",
        "imageUrl": "https://photo.kidzworld.com/images/2020323/8ccbee09-4440-47aa-9b49-b395c74dc10d/griffin-mythology-article.jpg"
    },
    {
        "id": 4,
        "type": "Noncombat",
        "title": "To Shreds You Say",
        "text": "\"A bandersnatch, in this place?\" you say to yourself before you are torn to shreds. (You got better)",
        "imageUrl": ""
    },
    {
        "id": 5,
        "type": "Noncombat",
        "title": "Misplaced Keys",
        "text": "You've misplaced your keys and are late to work.",
        "imageUrl": ""
    },
    {
        "id": 6,
        "type": "Noncombat",
        "title": "Oh Jeralt",
        "text": "A shine catches your eye from the ground. As you walk up to take a closer look you see it's a wolf medallion. \"Fudge\", you say.",
        "imageUrl": ""
    },
    {
        "id": 7,
        "type": "Noncombat",
        "title": "Wild Gophers",
        "text": "A pack of wild gophers gets the jump on you, after an incredibly embarrassing de-pantsing incident you continue your journey.",
        "imageUrl": ""
    },
    {
        "id": 8,
        "type": "Combat",
        "title": "Encantar",
        "text": "An enemy you find extremely attractive approaches you!",
        "imageUrl": ""
    },
    {
        "id": 9,
        "type": "Noncombat",
        "title": "Take Time",
        "text": "You stop to take a moment for yourself. Shutting your eyes, you breathe in deep and slowly release. After a few breaths you carry on.",
        "imageUrl": ""
    },
    {
        "id": 10,
        "type": "Combat",
        "title": "SOAT",
        "text": "A one meter tall spider wearing sneakers descends before you!",
        "imageUrl": ""
    },
    {
        "id": 11,
        "type": "Combat",
        "title": "Not The Bs",
        "text": "You are struck from behind with a jar of honey. The sound of pitter-pattering feet and giggling grows distant as a honeybear takes flight and approaches from a nearby cave!",
        "imageUrl": ""
    },
    {
        "id": 12,
        "type":"Noncombat",
        "title":"Oh Duck",
        "text": "A raft of ducks approches you. They seem adorable and you attempt to feed them, but for them, peace was never an option and they take all of your food and dignity.",
        "imageUrl": ""
    },
    {
        "id": 13,
        "type":"Combat",
        "title":"Whale Shit",
        "text":"You see an empty pier and approach the end of it to take in the fresh sea air, but your senses are assaulted by the scent of sulphur and whale feces. The demon whale, Monstro rises from the water to confront you.",
        "imageUrl": ""
    },
    {
        "id": 14,
        "type": "Noncombat",
        "title":"Merely a Fleshwound",
        "text": "As you walk through the woods you come upon a small creek crossing with an odd-looking figure obstructing the path. Upon closer inspection you realize the figure is the former Champion known as the Black Knight who was defeated in a duel with King Arthur in which he tragically lost all of his limbs, but none of his attitude. You step over him and continue your journey.",
        "imageUrl": ""
    },
    {
        "id": 15,
        "type":"Noncombat",
        "title":"The One Ring",
        "text":"You come upon a small pond and spot a shiny gold ring in the bottom, curious you reach into the water and pick it up and call it your precious",
        "imageUrl":""
    },
    {
        "id": 16,
        "type":"Combat",
        "title":"Pickle Rick",
        "text":"You encounter an angry weaponized pickle named Rick",
        "imageUrl": ""
    },
    {
        "id": 17,
        "type":"Noncombat",
        "title":"Prickle Rick",
        "text":"You encounter another angry pickle pickle but this time he's drunk and just insults you",
        "imageUrl": ""
    },
    {
        "id":18,
        "type":"Noncombat",
        "title":"Time for a drink",
        "text": "You stop in at a nearby pub and proceed to drink away your sorrows",
        "imageUrl": ""
    },
    {
        "id":19,
        "type":"Combat",
        "title":"Big Oops",
        "text":"You come across a large angry Giant",
        "imageUrl":""
    },
    {
        "id": 20,
        "type":"Noncombat",
        "title":"Kick Rocks",
        "text":"Bummed about the lack of action, you mope along the road kicking rocks like a loser",
        "imageUrl": ""
    }
]